# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [3]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [8]:
ser1 = pd.Series(data = np.random.randint(1,5,100))
ser2 = pd.Series(data = np.random.randint(1,4,100))
ser3 = pd.Series(data = np.random.randint(10000,30001,100))

### Step 3. Let's create a DataFrame by joinning the Series by column

In [9]:
df = pd.concat([ser1,ser2,ser3], axis=1)
df.head()

   0  1      2
0  1  1  23482
1  2  3  24397
2  1  1  27700
3  3  2  23110
4  3  2  20977

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [10]:
df.columns = ['bedrs', 'bathrs', 'price_sqr_meter']
df.head()

   bedrs  bathrs  price_sqr_meter
0      1       1            23482
1      2       3            24397
2      1       1            27700
3      3       2            23110
4      3       2            20977

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [14]:
bigcolumn = pd.concat([ser1,ser2,ser3], axis=0).to_frame()
bigcolumn.shape

(300, 1)

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [15]:
bigcolumn.index

Int64Index([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9,
            ...
            90, 91, 92, 93, 94, 95, 96, 97, 98, 99],
           dtype='int64', length=300)

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [17]:
bigcolumn.reset_index(inplace=True)
bigcolumn.tail()

     level_0  index      0
295      295     95  28205
296      296     96  21855
297      297     97  28192
298      298     98  15687
299      299     99  25235